app/models/user.rb

  def reset_session_token!
    self.session_token = SecureRandom.urlsafe_base64
    self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "97kXMCCyViZuylx2oKhGpQ"], ["updated_at", "2018-09-14 22:35:31.430880"], ["id", 1]]